// Generated from the supplied admission-rank workbooks.
export const ADMISSION_EXTENSIONS = {
  "tajrobi": {
    "1": {
      "6000_8000": [
        [
          "هوشبری",
          "دانشگاه علوم پزشکی ایران",
          7917
        ],
        [
          "بهداشت عمومی",
          "دانشگاه علوم پزشکی شهید بهشتی - تهران",
          7846
        ],
        [
          "زیست شناسی جانوری",
          "دانشگاه شهید بهشتی - تهران",
          7541
        ]
      ],
      "8000_10000": [
        [
          "میکروبیولوژی",
          "دانشگاه الزهرا (س) - تهران (ویژه خواهران)",
          9663
        ],
        [
          "مدیریت بیمه اکو",
          "دانشگاه علامه طباطبایی - تهران",
          9614
        ],
        [
          "شیمی کاربردی",
          "دانشگاه خوارزمی",
          9544
        ]
      ],
      "10000_14000": [
        [
          "شیمی کاربردی",
          "دانشگاه الزهرا (س) - تهران (ویژه خواهران)",
          13874
        ],
        [
          "مدیریت خدمات بهداشتی درمانی",
          "دانشگاه علوم پزشکی بقیه اله (عج) - تهران - استخدام سپاه",
          13773
        ],
        [
          "شیمی محض",
          "دانشگاه خوارزمی",
          13740
        ]
      ],
      "14000_18000": [
        [
          "مهندسی گیاه پزشکی",
          "دانشگاه تهران (محل تحصیل دانشکده فناوری کشاورزی پردیس کشاورزی و منابع طبیعی در پاکدشت)",
          17707
        ],
        [
          "حسابداری",
          "دانشگاه غيرانتفاعي ارشاد-دماوند (محل تحصيل تهران)",
          17533
        ],
        [
          "روانشناسی",
          "دانشگاه پیام نور استان تهران -تهران جنوب",
          17183
        ]
      ],
      "18000_24000": [
        [
          "مدیریت مالی",
          "استان تهران - موسسه غیر انتفاعی ارشاد (محل تحصیل واحد تهران)",
          23921
        ],
        [
          "کاردانی فوریت های پزشکی پیش بیمارستانی",
          "دانشگاه علوم پزشکی تهران",
          23795
        ],
        [
          "علم اطلاعات و دانش شناسی",
          "دانشگاه الزهرا (س) - تهران (ویژه خواهران)",
          23658
        ]
      ],
      "24000_30000": [
        [
          "روانشناسی",
          "دانشگاه پيام نور تهران-مرکز پرند",
          28802
        ],
        [
          "مدیریت دولتی",
          "دانشگاه پیام نور استان تهران -تهران غرب",
          28403
        ],
        [
          "شیمی کاربردی",
          "دانشگاه پیام نور استان تهران - تهران شرق",
          27560
        ]
      ]
    },
    "2": {
      "6000_8000": [
        [
          "پزشکی",
          "دانشگاه علوم پزشکی مازندران - ساری",
          7968
        ],
        [
          "دندانپزشکی",
          "دانشگاه علوم پزشکی اردبیل",
          6860
        ],
        [
          "داروسازی",
          "دانشگاه علوم پزشکی بقیه اله (عج) - تهران - استخدام سپاه",
          7416
        ]
      ],
      "8000_10000": [
        [
          "فناوری اطلاعات سلامت",
          "دانشگاه علوم پزشکی تهران",
          9942
        ],
        [
          "شیمی کاربردی",
          "دانشگاه صنعتی شریف - تهران",
          9596
        ],
        [
          "تکنولوژی اتاق عمل",
          "دانشگاه علوم پزشکی ایران",
          9552
        ]
      ],
      "10000_14000": [
        [
          "علوم و صنایع غذایی",
          "دانشگاه علوم پزشکی شهید بهشتی - تهران",
          13869
        ],
        [
          "پرستاری",
          "دانشگاه علوم پزشکی بقیه اله (عج) - تهران - استخدام سپاه",
          13396
        ],
        [
          "حسابداری",
          "دانشگاه علامه طباطبایی - تهران",
          13295
        ]
      ],
      "14000_18000": [
        [
          "حسابداری",
          "دانشگاه صنعت نفت (محل تحصیل واحد تهران)",
          17989
        ],
        [
          "زیست شناسی سلولی مولکولی",
          "دانشگاه خوارزمی",
          17710
        ],
        [
          "بهداشت عمومی",
          "دانشگاه علوم پزشکی بقیه اله (عج) - تهران - استخدام سپاه",
          17520
        ]
      ],
      "18000_24000": [
        [
          "زمین شناسی",
          "دانشگاه تهران",
          23413
        ],
        [
          "مدیریت خدمات بهداشتی درمانی",
          "دانشگاه علوم پزشکی بقیه اله (عج) - تهران - استخدام سپاه",
          23247
        ],
        [
          "علوم و صنایع غذایی",
          "دانشگاه علوم پزشکی شهید بهشتی - تهران",
          22586
        ]
      ],
      "24000_30000": [
        [
          "روانشناسی",
          "دانشگاه پيام نور تهران-مرکز پاکدشت",
          29533
        ],
        [
          "گردشگری",
          "دانشگاه علامه طباطبایی - تهران",
          29483
        ],
        [
          "مهندسی بهداشت محیط",
          "دانشگاه علوم پزشکی تهران",
          29003
        ]
      ]
    },
    "3": {
      "6000_8000": [
        [
          "تکنولوژی پرتو درمانی",
          "دانشگاه علوم پزشکی شهید بهشتی - تهران",
          7721
        ],
        [
          "گفتار درمانی",
          "دانشگاه علوم توانبخشی و سلامت اجتماعی - تهران (رشته های پزشکی)",
          7390
        ],
        [
          "هوشبری",
          "دانشگاه علوم پزشکی تهران",
          7136
        ]
      ],
      "8000_10000": [
        [
          "زیست شناسی سلولی مولکولی",
          "دانشگاه تهران",
          9267
        ],
        [
          "کار درمانی",
          "دانشگاه علوم توانبخشی و سلامت اجتماعی - تهران (رشته های پزشکی)",
          9137
        ],
        [
          "بهداشت عمومی",
          "دانشگاه علوم پزشکی تهران",
          9091
        ]
      ],
      "10000_14000": [
        [
          "فناوری اطلاعات سلامت",
          "دانشگاه علوم پزشکی تهران",
          13929
        ],
        [
          "میکروبیولوژی",
          "دانشگاه تهران",
          13750
        ],
        [
          "حسابداری",
          "دانشگاه خوارزمی",
          13127
        ]
      ],
      "14000_18000": [
        [
          "علوم و صنایع غذایی",
          "دانشگاه علوم پزشکی شهید بهشتی - تهران",
          17874
        ],
        [
          "مدیریت مالی",
          "دانشگاه خوارزمی",
          17539
        ],
        [
          "میکروبیولوژی",
          "دانشگاه الزهرا (س) - تهران (ویژه خواهران)",
          16515
        ]
      ],
      "18000_24000": [
        [
          "علوم و مهندسی صنایع غذایی (این رشته متعلق به گروه کشاورزی است)",
          "دانشگاه تهران (محل تحصیل پردیس کشاورزی و منابع طبیعی کرج)",
          23905
        ],
        [
          "علوم و صنایع غذایی",
          "دانشگاه علوم پزشکی شهید بهشتی - تهران",
          23184
        ],
        [
          "هوشبری",
          "دانشگاه علوم پزشکی ایرانشهر",
          23094
        ]
      ],
      "24000_30000": [
        [
          "زیست شناسی گیاهی",
          "دانشگاه تهران",
          29221
        ],
        [
          "علوم آزمایشگاهی",
          "دانشگاه علوم پزشکی ایرانشهر",
          28810
        ],
        [
          "شیمی کاربردی",
          "دانشگاه الزهرا (س) - تهران (ویژه خواهران)",
          28330
        ]
      ]
    }
  },
  "riazi": {
    "1": {
      "6000_8000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه شهید چمران اهواز",
          7855
        ],
        [
          "مهندسی برق",
          "دانشگاه تبریز",
          7487
        ],
        [
          "مهندسی مکانیک",
          "استان تهران - دانشگاه غیر انتفاعی علم و فرهنگ - تهران",
          6822
        ]
      ],
      "8000_10000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه شهید مدنی آذربایجان - تبریز",
          9962
        ],
        [
          "مهندسی برق",
          "دانشگاه صنعتی نوشیروانی بابل",
          9310
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه تبریز",
          8841
        ]
      ],
      "10000_14000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه غيرانتفاعي ارشاد-دماوند (محل تحصيل دماوند)",
          12721
        ],
        [
          "مهندسی برق",
          "دانشگاه صنعتی قم",
          11447
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه شهرکرد",
          13974
        ]
      ],
      "14000_18000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه تبریز (محل تحصیل دانشکده فنی و مهندسی میانه)",
          16213
        ],
        [
          "مهندسی برق",
          "دانشگاه کاشان",
          14949
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه سمنان",
          17808
        ]
      ],
      "18000_24000": [
        [
          "مهندسی کامپیوتر",
          "استان قزوین - دانشگاه غیرانتفاعی دانش البرز - آبیک",
          23138
        ],
        [
          "مهندسی برق",
          "دانشگاه یاسوج",
          19302
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه تبریز (محل تحصیل دانشکده فنی و مهندسی میانه)",
          23833
        ]
      ],
      "24000_30000": [
        [
          "مدیریت صنعتی",
          "دانشگاه پیام نور استان تهران - مرکز اسلامشهر",
          27000
        ],
        [
          "مهندسی معماری",
          "استان تهران - دانشگاه غیر انتفاعی علم و فرهنگ - تهران",
          27000
        ],
        [
          "مهندسی عمران",
          "دانشگاه آزاد اسلامی واحد تهران غرب",
          27000
        ]
      ]
    },
    "2": {
      "6000_8000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه شهید مدنی آذربایجان - تبریز",
          7774
        ],
        [
          "مهندسی برق",
          "دانشگاه مازندران - بابلسر",
          7480
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه صنعتی قم",
          7707
        ]
      ],
      "8000_10000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه اردکان",
          9624
        ],
        [
          "مهندسی برق",
          "مرکز آموزش عالی فنی و مهندسی بویین زهرا",
          9934
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه گیلان - رشت",
          9837
        ]
      ],
      "10000_14000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه صنعتی خاتم الانبیاء (ص) بهبهان",
          13805
        ],
        [
          "مهندسی برق",
          "دانشگاه مازندران - بابلسر",
          13481
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه صنعتی همدان",
          12960
        ]
      ],
      "14000_18000": [
        [
          "مهندسی کامپیوتر",
          "مجتمع آموزش عالی بم",
          17976
        ],
        [
          "مهندسی برق",
          "دانشگاه ایلام",
          17962
        ],
        [
          "مهندسی مکانیک",
          "مجتمع آموزش عالی بم",
          17993
        ]
      ],
      "18000_24000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه غيرانتفاعي ارشاد-دماوند (محل تحصيل دماوند)",
          21351
        ],
        [
          "مهندسی برق",
          "دانشگاه کردستان - سنندج",
          23556
        ],
        [
          "مهندسی مکانیک",
          "مرکز آموزش عالی محلات",
          23701
        ]
      ],
      "24000_30000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه ولایت - ایرانشهر",
          27256
        ],
        [
          "مهندسی برق",
          "دانشگاه لرستان - خرم آباد",
          29961
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه بیرجند",
          28500
        ]
      ]
    },
    "3": {
      "6000_8000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه سلمان فارسی - کازرون",
          7342
        ],
        [
          "مهندسی برق",
          "دانشگاه زنجان",
          7469
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه سمنان",
          7888
        ]
      ],
      "8000_10000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه آیت الله بروجردی - بروجرد",
          9232
        ],
        [
          "مهندسی برق",
          "دانشگاه محقق اردبیلی - اردبیل",
          9883
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه ارومیه",
          9380
        ]
      ],
      "10000_14000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه تبریز (محل تحصیل دانشکده فنی و مهندسی میانه)",
          11801
        ],
        [
          "مهندسی برق",
          "دانشگاه اصفهان (محل تحصیل مرکز آموزش عالی شهرضا)",
          13969
        ],
        [
          "مهندسی مکانیک",
          "دانشگاه لرستان - خرم آباد",
          13926
        ]
      ],
      "14000_18000": [
        [
          "مهندسی کامپیوتر",
          "دانشگاه ولی عصر (عج) - رفسنجان",
          14985
        ],
        [
          "مهندسی برق",
          "مرکز آموزش عالی اقلید",
          17489
        ],
        [
          "مهندسی مکانیک",
          "مرکز آموزش عالی محلات",
          17305
        ]
      ],
      "18000_24000": [
        [
          "مدیریت صنعتی",
          "دانشگاه پیام نور استان تهران - مرکز اسلامشهر",
          27000
        ],
        [
          "مهندسی معماری",
          "استان تهران - دانشگاه غیر انتفاعی علم و فرهنگ - تهران",
          27000
        ],
        [
          "مهندسی عمران",
          "دانشگاه آزاد اسلامی واحد تهران غرب",
          27000
        ]
      ],
      "24000_30000": [
        [
          "مدیریت صنعتی",
          "دانشگاه پیام نور استان تهران - مرکز اسلامشهر",
          27000
        ],
        [
          "مهندسی معماری",
          "استان تهران - دانشگاه غیر انتفاعی علم و فرهنگ - تهران",
          27000
        ],
        [
          "مهندسی عمران",
          "دانشگاه آزاد اسلامی واحد تهران غرب",
          27000
        ]
      ]
    }
  },
  "ensani": {
    "1": {
      "6000_8000": [
        [
          "حقوق",
          "دانشگاه پیام نور استان آذربایجان شرقی - مرکز تبریز",
          7414
        ],
        [
          "اقتصاد",
          "دانشگاه علوم و فنون دریایی خرمشهر",
          7931
        ],
        [
          "روانشناسی",
          "دانشگاه پیام نور استان تهران - واحد ری",
          7513
        ]
      ],
      "8000_10000": [
        [
          "حقوق",
          "دانشگاه پيام نور اصفهان-مرکز اصفهان",
          9975
        ],
        [
          "اقتصاد",
          "دانشگاه لرستان - خرم آباد",
          8168
        ],
        [
          "روانشناسی",
          "دانشگاه غيرانتفاعي بهار - مشهد ",
          8334
        ]
      ],
      "10000_14000": [
        [
          "حقوق",
          "دانشگاه پیام نور استان تهران - واحد لواسانات",
          12976
        ],
        [
          "اقتصاد",
          "دانشگاه پیام نور استان تهران - تهران شرق",
          10909
        ],
        [
          "روانشناسی",
          "دانشگاه پیام نور استان تهران - واحد لواسانات",
          12377
        ]
      ],
      "14000_18000": [
        [
          "مدیریت دولتی",
          "دانشگاه پیام نور استان تهران - واحد ری",
          17211
        ],
        [
          "روانشناسی",
          "دانشگاه پيام نور استان تهران - واحد شهر جديد پرديس",
          16270
        ],
        [
          "گردشگری",
          "دانشگاه پیام نور استان تهران -تهران غرب",
          15976
        ]
      ],
      "18000_24000": [
        [
          "حسابداری",
          "دانشگاه پيام نور تهران-مرکز پرند",
          23828
        ],
        [
          "حقوق",
          "دانشگاه پيام نور تهران-واحد بهارستان",
          23196
        ],
        [
          "علوم ارتباطات اجتماعی",
          "استان تهران - دانشکده غیرانتفاعی رفاه (ویژه خواهران)- تهران",
          22744
        ]
      ],
      "24000_30000": [
        [
          "مدیریت بازرگانی",
          "دانشگاه پيام نور تهران-واحد رباط كريم",
          29371
        ],
        [
          "الهیات و معارف اسلامی",
          "استان تهران - دانشکده غیرانتفاعی رفاه (ویژه خواهران)- تهران",
          27862
        ],
        [
          "حقوق",
          "دانشگاه پیام نور استان تهران - واحد پیشوا",
          25448
        ]
      ]
    },
    "2": {
      "6000_8000": [
        [
          "حقوق",
          "دانشگاه سیستان و بلوچستان - زاهدان",
          7568
        ],
        [
          "اقتصاد",
          "دانشگاه حکیم سبزواری - سبزوار",
          7867
        ],
        [
          "روانشناسی",
          "دانشگاه مراغه",
          7019
        ]
      ],
      "8000_10000": [
        [
          "مدیریت امور بانکی",
          "استان تهران - دانشگاه غیر انتفاعی خاتم - تهران",
          9910
        ],
        [
          "تاریخ",
          "دانشگاه شهید بهشتی - تهران",
          9769
        ],
        [
          "جامعه شناسی",
          "دانشگاه شاهد - تهران",
          9606
        ]
      ],
      "10000_14000": [
        [
          "حقوق",
          "استان تهران - دانشگاه غیر انتفاعی خاتم - تهران",
          11689
        ],
        [
          "اقتصاد",
          "دانشگاه بجنورد",
          13643
        ],
        [
          "روانشناسی",
          "دانشگاه پیام نور استان آذربایجان غربی - مرکز ارومیه",
          13857
        ]
      ],
      "14000_18000": [
        [
          "حقوق",
          "دانشگاه پیام نور استان البرز - مرکز کرج",
          17564
        ],
        [
          "اقتصاد",
          "دانشگاه آیت الله بروجردی - بروجرد",
          15988
        ],
        [
          "روانشناسی",
          "دانشگاه پيام نور اصفهان - مرکز نجف آباد",
          15471
        ]
      ],
      "18000_24000": [
        [
          "حقوق",
          "دانشگاه پیام نور استان اردبیل - مرکز اردبیل",
          23747
        ],
        [
          "اقتصاد",
          "دانشگاه صنعتی شاهرود",
          19628
        ],
        [
          "روانشناسی",
          "دانشگاه پیام نور استان همدان - مرکز همدان",
          22376
        ]
      ],
      "24000_30000": [
        [
          "حقوق",
          "دانشگاه پیام نور استان قم - مرکز قم",
          28892
        ],
        [
          "اقتصاد",
          "دانشگاه پیام نور استان تهران -تهران غرب",
          25187
        ],
        [
          "روانشناسی",
          "دانشگاه پيام نور البرز - واحد اشتهارد ",
          29645
        ]
      ]
    },
    "3": {
      "6000_8000": [
        [
          "زبان و ادبیات عربی",
          "دانشگاه تهران",
          7787
        ],
        [
          "مطالعات خانواده",
          "دانشگاه الزهرا (س) - تهران (ویژه خواهران)",
          6617
        ],
        [
          "جغرافیا",
          "دانشگاه شهید بهشتی - تهران",
          6245
        ]
      ],
      "8000_10000": [
        [
          "زبان و ادبیات فارسی",
          "دانشگاه الزهرا (س) - تهران (ویژه خواهران)",
          9322
        ],
        [
          "فلسفه",
          "دانشگاه علامه طباطبایی - تهران",
          9203
        ],
        [
          "تربیت بدنی و علوم ورزشی",
          "دانشگاه شهید بهشتی - تهران",
          9009
        ]
      ],
      "10000_14000": [
        [
          "تربیت بدنی و علوم ورزشی",
          "دانشگاه الزهرا (س) - تهران (ویژه خواهران)",
          13112
        ],
        [
          "فلسفه",
          "دانشگاه شهید بهشتی - تهران",
          13074
        ],
        [
          "زبان و ادبیات فارسی",
          "دانشگاه خوارزمی",
          12117
        ]
      ],
      "14000_18000": [
        [
          "حقوق",
          "دانشگاه سیستان و بلوچستان - زاهدان",
          16815
        ],
        [
          "اقتصاد",
          "دانشگاه ارومیه",
          17189
        ],
        [
          "روانشناسی",
          "دانشگاه سیستان و بلوچستان - زاهدان",
          17467
        ]
      ],
      "18000_24000": [
        [
          "حقوق",
          "دانشگاه هرمزگان - بندرعباس",
          22859
        ],
        [
          "اقتصاد",
          "دانشگاه گنبد",
          23945
        ],
        [
          "روانشناسی",
          "دانشگاه پيام نور قزوين - مرکز قزوين ",
          23895
        ]
      ],
      "24000_30000": [
        [
          "حقوق",
          "دانشگاه پیام نور استان آذربایجان غربی - مرکز ارومیه",
          29091
        ],
        [
          "اقتصاد",
          "دانشگاه خلیج فارس - بوشهر",
          29911
        ],
        [
          "روانشناسی",
          "دانشگاه لرستان - خرم آباد (محل تحصیل پلدختر)",
          25903
        ]
      ]
    }
  }
}
